{
  "type": "object",
  "properties": {
    "id": {
      "type": [
        "string",
        "null"
      ]
    },
    "templateId": {
      "type": [
        "string",
        "null"
      ]
    },
    "displayName": {
      "type": [
        "string",
        "null"
      ]
    },
    "createdDateTime": {
      "type": [
        "string",
        "null"
      ],
      "format": "date-time"
    },
    "modifiedDateTime": {
      "type": [
        "string",
        "null"
      ],
      "format": "date-time"
    },
    "state": {
      "type": [
        "string",
        "null"
      ]
    },
    "sessionControls": {
      "type": [
        "object",
        "null"
      ],
      "additionalProperties": true
    },
    "conditions": {
      "type": [
        "object",
        "null"
      ],
      "properties": {
        "userRiskLevels": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "signInRiskLevels": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "clientAppTypes": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "servicePrincipalRiskLevels": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "insiderRiskLevels": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "platforms": {
          "type": [
            "object",
            "null"
          ],
          "additionalProperties": true
        },
        "locations": {
          "type": [
            "object",
            "null"
          ],
          "additionalProperties": true
        },
        "devices": {
          "type": [
            "object",
            "null"
          ],
          "additionalProperties": true
        },
        "clientApplications": {
          "type": [
            "object",
            "null"
          ],
          "additionalProperties": true
        },
        "applications": {
          "type": [
            "object",
            "null"
          ],
          "properties": {
            "includeApplications": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "excludeApplications": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "includeUserActions": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "includeAuthenticationContextClassReferences": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "applicationFilter": {
              "type": [
                "string",
                "null"
              ]
            }
          },
          "additionalProperties": false
        },
        "users": {
          "type": [
            "object",
            "null"
          ],
          "properties": {
            "includeUsers": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "excludeUsers": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "includeGroups": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "excludeGroups": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "includeRoles": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "excludeRoles": {
              "type": [
                "array",
                "null"
              ],
              "items": {
                "type": "string"
              }
            },
            "includeGuestsOrExternalUsers": {
              "type": [
                "boolean",
                "null"
              ]
            },
            "excludeGuestsOrExternalUsers": {
              "type": [
                "boolean",
                "null"
              ]
            }
          },
          "additionalProperties": false
        }
      },
      "additionalProperties": false
    },
    "grantControls": {
      "type": [
        "object",
        "null"
      ],
      "properties": {
        "operator": {
          "type": [
            "string",
            "null"
          ]
        },
        "builtInControls": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "customAuthenticationFactors": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "termsOfUse": {
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string"
          }
        },
        "authenticationStrength@odata.context": {
          "type": [
            "string",
            "null"
          ]
        },
        "authenticationStrength": {
          "type": [
            "object",
            "null"
          ],
          "additionalProperties": true
        }
      },
      "additionalProperties": false
    }
  },
  "additionalProperties": false
}
