{
  "type": "object",
  "properties": {
    "id": {
      "type": [
        "null",
        "string"
      ]
    },
    "displayName": {
      "type": [
        "null",
        "string"
      ]
    },
    "state": {
      "type": [
        "null",
        "string"
      ]
    },
    "conditions": {
      "type": [
        "null",
        "object"
      ],
      "additionalProperties": false,
      "properties": {}
    },
    "grantControls": {
      "type": [
        "null",
        "object"
      ],
      "additionalProperties": false,
      "properties": {}
    },
    "sessionControls": {
      "type": [
        "null",
        "object"
      ],
      "additionalProperties": false,
      "properties": {}
    }
  }
}